app/views/articles/index.html.erb

SELECT "articles".* FROM "articles" ORDER BY created_at desc
---

  <% Article.all.order('created_at desc').each do |article| %>