app/views/users/index.html.erb

SELECT "users".* FROM "users" ORDER BY email
---
    <tbody>
      <% User.all.order('email').each do |user| %>