app/views/users/show.html.erb


<% user = User.find_by(id: params["id"]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]