app/views/videos/index.html.erb

SELECT "videos".* FROM "videos" ORDER BY created_at desc
---

  <% Video.all.order('created_at desc').each do |video| %>