app/controllers/poses_controller.rb

SELECT  "poses".* FROM "poses" WHERE "poses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "poses" SET "pose_type" = ?, "pose_url" = ?, "updated_at" = ? WHERE "poses"."id" = ?  [["pose_type", ""], ["pose_url", nil], ["updated_at", "2018-02-17 17:30:38.328385"], ["id", 2]]
---
	def update
		pose = Pose.find_by(id: params["id"])
		pose.title = params["title"]
		pose.pose_type = params["pose_type"]
		pose.benefit = params["benefit"]
		pose.level = params["level"]
		pose.anatomy = params["anatomy"]
		pose.pose_url = params["pose_url"]
		pose.step = params["step"]
		pose.save

SELECT  "poses".* FROM "poses" WHERE "poses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "poses" WHERE "poses"."id" = ?  [["id", 4]]
---
	def destroy
		pose = Pose.find_by(id: params["id"])
		pose.delete

INSERT INTO "poses" ("benefit", "level", "anatomy", "created_at", "updated_at", "title", "pose_url", "step", "pose_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		Pose.create :title => params["title"],
					:pose_type => params["pose_type"],
					:benefit => params["benefit"],
					:level => params["level"],
					:anatomy => params["anatomy"],
					:pose_url => params["pose_url"],
					:step => params["step"]