app/controllers/users_controller.rb

  def index
    @users = User.all.order('email')
---
SELECT "users".* FROM "users" ORDER BY email

  def update
    user = User.find_by(id: params["id"])
    user.user_name = params["user_name"]
    user.email = params["email"]
    user.password = params["password"]
    user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "user_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "Orin"], ["password_digest", "$2a$10$JZHUCTTxrBVNY2tmVByLfes8fwuvDnEhIGT5l9kNUOugIQRafBs4K"], ["updated_at", "2018-03-08 18:44:29.896823"], ["id", 68]]

  def destroy
    user = User.find_by(id: params["id"])
    user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def create # POST /users
    # @user = User.create :email => params["email"], :password => params["password"]
    @user = User.new
    @user.user_name = params["user_name"]
    @user.email = params["email"]
    @user.password = params["password"]

    # if @user.errors.any?
    if @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["email", "orin.xie@gmail.com"], ["password", "789"], ["created_at", "2018-02-23 06:04:01.973997"], ["updated_at", "2018-02-23 06:04:01.973997"], ["user_name", "OrinXie"]]