app/views/poses/edit.html.erb

SELECT  "poses".* FROM "poses" WHERE "poses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% pose = Pose.find_by(id: params["id"]) %>