app/views/poses/index.html.erb

SELECT "poses".* FROM "poses" ORDER BY created_at desc
---

	<% Pose.all.order('created_at desc').each do |pose| %>