app/views/poses/show.html.erb


<% pose = Pose.find_by(id: params["id"]) %>
---
SELECT  "poses".* FROM "poses" WHERE "poses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]